[
    {
      "id": 1,
      "segment_name": "Penthouse",
      "estate_title": "Luxurious Downtown Penthouse",
      "short_description": "Stunning penthouse in the heart of downtown NYC",
      "description": "Step into the epitome of urban luxury with this stunning penthouse located in the heart of downtown New York City. Perched high above the bustling streets, this residence offers unparalleled views of the iconic skyline, including landmarks like the Empire State Building and One World Trade Center. The interior boasts a seamless blend of modern design and timeless elegance, with floor-to-ceiling windows flooding the space with natural light. Enjoy the ultimate in privacy and exclusivity, with amenities including a private terrace for al fresco dining, an infinity pool for leisurely swims against the backdrop of the cityscape, and a gourmet kitchen equipped with top-of-the-line appliances for culinary enthusiasts. Perfectly situated for those seeking the ultimate urban retreat, this penthouse represents a rare opportunity to experience sophisticated city living at its finest.",
      "price": "$6,500,000",
      "status": "sale",
      "area": "4,000 sq ft",
      "location": "New York City, New York, USA",
      "latitude": 40.7128,
      "longitude": -74.0060,
      "facilities": ["Private Terrace", "Infinity Pool", "Gourmet Kitchen", "Home Theater", "Fitness Center"],
      "image": "downtown_penthouse.jpg"
    },
    {
      "id": 2,
      "segment_name": "Penthouse",
      "estate_title": "Exclusive Beachfront Penthouse",
      "short_description": "Exclusive penthouse with panoramic ocean views",
      "description": "Escape to a world of unparalleled luxury with this exclusive beachfront penthouse in the breathtaking Maldives. Nestled on the pristine shores of a secluded island, this residence offers panoramic views of the turquoise waters and powdery white sands that define the Maldivian paradise. The interior exudes sophistication and comfort, with spacious living areas designed to maximize natural light and ocean breezes. Step onto your private terrace and feel the stress melt away as you soak in the spectacular sunset over the Indian Ocean. With direct beach access, a rooftop deck for entertaining under the stars, a rejuvenating spa for ultimate relaxation, and a fully equipped outdoor barbecue area for al fresco dining, every aspect of this penthouse has been meticulously crafted to provide the ultimate beachfront lifestyle.",
      "price": "$8,200,000",
      "status": "sale",
      "area": "5,500 sq ft",
      "location": "Maldives",
      "latitude": 3.2028,
      "longitude": 73.2207,
      "facilities": ["Private Beach Access", "Roof Deck", "Spa", "Outdoor Barbecue", "Yoga Studio"],
      "image": "beachfront_penthouse.jpg"
    },
    {
      "id": 3,
      "segment_name": "Resort",
      "estate_title": "Tropical Paradise Resort",
      "short_description": "Secluded luxury resort in Bora Bora",
      "description": "Discover a hidden gem nestled among the pristine shores and lush landscapes of Bora Bora's secluded islands. This luxurious tropical resort offers an unparalleled escape from the ordinary, where crystal-clear waters meet powder-soft sands in a breathtaking display of natural beauty. Surrounded by swaying palm trees and vibrant coral reefs, the resort's elegant accommodations provide the perfect blend of comfort and sophistication. Indulge in world-class amenities, including a private beach for secluded sunbathing, an infinity pool overlooking the turquoise lagoon, and multiple restaurants serving gourmet cuisine inspired by the flavors of the South Pacific. Whether you're seeking adventure or relaxation, this tropical paradise offers an unforgettable experience that will leave you rejuvenated and inspired.",
      "price": "$20,000,000",
      "status": "sale",
      "area": "10 acres",
      "location": "Bora Bora, French Polynesia",
      "latitude": -16.5004,
      "longitude": -151.7480,
      "facilities": ["Private Beach", "Infinity Pool", "Multiple Restaurants", "Spa & Wellness Center", "Water Sports Facilities"],
      "image": "tropical_paradise_resort.jpg"
    },
    {
      "id": 4,
      "segment_name": "Resort",
      "estate_title": "Luxury Ski Resort",
      "short_description": "Ski resort nestled in the heart of Aspen",
      "description": "Experience the pinnacle of alpine luxury at this exclusive ski resort nestled in the heart of Aspen, Colorado. Surrounded by snow-capped peaks and pristine forests, this winter wonderland offers an unforgettable escape for outdoor enthusiasts and luxury seekers alike. The resort's elegant accommodations blend rustic charm with modern amenities, providing a cozy retreat after a day on the slopes. Enjoy world-class skiing and snowboarding right outside your doorstep, then unwind with a soothing spa treatment or indulge in après-ski cocktails by the roaring fireplace. With gourmet dining options, boutique shopping, and vibrant nightlife just moments away, this ski resort promises an unforgettable mountain getaway.",
      "price": "$30,000,000",
      "status": "sale",
      "area": "20 acres",
      "location": "Aspen, Colorado, USA",
      "latitude": 39.1911,
      "longitude": -106.8236,
      "facilities": ["Ski-In/Ski-Out", "Spa", "Après-Ski Lounge", "Fitness Center", "Fine Dining Restaurant"],
      "image": "ski_resort.jpg"
    },
    {
      "id": 5,
      "segment_name": "Private Island",
      "estate_title": "Secluded Private Island Retreat",
      "short_description": "Ultimate privacy on a private island in the Bahamas",
      "description": "Escape to your own private paradise with this exclusive island retreat in the idyllic Exuma Cays, Bahamas. Surrounded by crystal-clear waters and pristine white sands, this secluded sanctuary offers the ultimate in luxury and seclusion. The island's luxurious accommodations provide a serene oasis for relaxation and rejuvenation, with spacious villas overlooking the turquoise sea. Explore the vibrant coral reefs with a snorkeling adventure, unwind with a massage on the private beach, or simply soak up the sun by the infinity pool. With world-class amenities and unparalleled natural beauty, this private island retreat offers an unforgettable escape from the ordinary.",
      "price": "$50,000,000",
      "status": "sale",
      "area": "100 acres",
      "location": "Exuma Cays, Bahamas",
      "latitude": 23.6159,
      "longitude": -75.9586,
      "facilities": ["Private Beaches", "Luxury Villas", "Helipad", "Marina", "Tennis Court"],
      "image": "private_island_retreat.jpg"
    },
    {
      "id": 6,
      "segment_name": "Villa",
      "estate_title": "Mediterranean Villa with Ocean Views",
      "short_description": "Exquisite villa with panoramic ocean views in Marbella",
      "description": "Embrace the tranquility of Mediterranean living with this exquisite villa boasting panoramic ocean views in the coveted Marbella region of Spain. Perched atop a picturesque hillside, this luxurious residence offers sweeping vistas of the sparkling Mediterranean Sea and the lush surrounding landscape. The villa's elegant interiors are adorned with opulent furnishings and fine architectural details, creating a sense of timeless sophistication and refinement. Step outside to discover expansive terraces, meticulously landscaped gardens, and a sparkling infinity pool overlooking the azure waters below. With its serene ambiance and unparalleled beauty, this Mediterranean villa provides the perfect retreat for those seeking a life of luxury and relaxation.",
      "price": "$12,000/month",
      "status": "rent",
      "area": "7,000 sq ft",
      "location": "Marbella, Spain",
      "latitude": 36.5107,
      "longitude": -4.8241,
      "facilities": ["Infinity Pool", "Terrace", "Mediterranean Garden", "Private Parking", "Security System"],
      "image": "mediterranean_villa.jpg"
    },
    {
      "id": 7,
      "segment_name": "Mansion",
      "estate_title": "Historic Estate in the Hamptons",
      "short_description": "Historic mansion in East Hampton",
      "description": "Step back in time and experience the grandeur of a bygone era with this historic estate nestled in the prestigious Hamptons. Built in the grand colonial style, this magnificent mansion exudes timeless elegance and sophistication, offering a rare glimpse into the region's storied past. The estate's sprawling grounds encompass manicured gardens, lush lawns, and a private tennis court, providing the perfect backdrop for outdoor entertaining and leisurely strolls. Inside, the mansion's opulent interiors feature exquisite period details, including hand-carved woodwork, ornate plaster moldings, and gleaming hardwood floors. With its rich history and unparalleled charm, this historic estate offers a once-in-a-lifetime opportunity to own a piece of Hamptons history.",
      "price": "$25,000,000",
      "status": "sale",
      "area": "15,000 sq ft",
      "location": "East Hampton, New York, USA",
      "latitude": 40.9634,
      "longitude": -72.6851,
      "facilities": ["Gated Property", "Tennis Court", "Guest House", "Wine Cellar", "Home Office"],
      "image": "historic_hamptons_estate.jpg"
    },
    {
      "id": 8,
      "segment_name": "Villa",
      "estate_title": "Tropical Oasis Villa in Bali",
      "short_description": "Tranquil villa in Ubud, Bali",
      "description": "Escape to your own tropical oasis with this stunning villa nestled in the heart of Ubud, Bali, Indonesia. Surrounded by lush gardens and tranquil ponds, this villa offers a peaceful retreat from the hustle and bustle of everyday life. Step inside to discover a harmonious blend of Balinese architecture and contemporary design, with spacious living areas that open onto expansive outdoor terraces. Relax by the sparkling pool, dine alfresco in the shaded pavilion, or unwind in the traditional bale overlooking the lush tropical landscape. With luxurious amenities and attentive staff to cater to your every need, this villa provides the perfect setting for a truly unforgettable escape.",
      "price": "$8,500/month",
      "status": "rent",
      "area": "5,000 sq ft",
      "location": "Ubud, Bali, Indonesia",
      "latitude": -8.5192,
      "longitude": 115.1889,
      "facilities": ["Private Pool", "Outdoor Pavilion", "Balinese-style Architecture", "Maid's Quarters", "Lounge Area"],
      "image": "bali_villa.jpg"
    },
    {
      "id": 9,
      "segment_name": "Beachfront Property",
      "estate_title": "Seaside Luxury Villa in Santorini",
      "short_description": "Luxurious villa with Aegean Sea views in Santorini",
      "description": "Indulge in the ultimate beachfront lifestyle with this luxurious villa perched on the cliffs of Santorini, Greece. Offering breathtaking views of the Aegean Sea and unparalleled luxury, this villa is the epitome of Greek island living. Immerse yourself in the timeless beauty of Santorini's whitewashed buildings and cobalt blue waters as you relax in the comfort of your own private sanctuary. The villa's elegant interiors feature modern amenities and traditional Cycladic architecture, creating a serene and inviting atmosphere. Step outside to your private terrace and soak up the Mediterranean sun, or take a refreshing dip in the infinity pool overlooking the azure sea below. With its idyllic setting and world-class amenities, this seaside villa offers the perfect retreat for those seeking the ultimate in luxury and relaxation.",
      "price": "$15,000/month",
      "status": "rent",
      "area": "6,500 sq ft",
      "location": "Santorini, Greece",
      "latitude": 36.3932,
      "longitude": 25.3960,
      "facilities": ["Private Beach Access", "Infinity Pool", "Sunset Terrace", "Outdoor Dining Area", "Concierge Service"],
      "image": "santorini_luxury_villa.jpg"
    }
  ]
  